nxp-mcuxpresso/mcux-sdk-examples/evkmcimx7ulp/multicore_examples/rpmsg_lite_str_echo_rtos/pin_mux.h
/* PTA31 (number AF24), WL_HOST_WAKE */
/* Routed pin properties */
#define BOARD_WL_HOST_WAKE_PERIPHERAL                                        PTA   /*!< Peripheral name */
#define BOARD_WL_HOST_WAKE_SIGNAL                                           port   /*!< Signal name */
#define BOARD_WL_HOST_WAKE_CHANNEL                                            31   /*!< Signal channel */
#define BOARD_WL_HOST_WAKE_PIN_NAME                                        PTA31   /*!< Routed pin name */
#define BOARD_WL_HOST_WAKE_PIN_FUNCTION_ID                    IOMUXC_PTA31_PTA31   /*!< Pin function id */
#define BOARD_WL_HOST_WAKE_LABEL                                  "WL_HOST_WAKE"   /*!< Label */
#define BOARD_WL_HOST_WAKE_NAME                                   "WL_HOST_WAKE"   /*!< Identifier */

/* PTB1 (number AF2), I2S1_TX_BCLK */
/* Routed pin properties */
#define BOARD_I2S1_TX_BCLK_PERIPHERAL                                        PTB   /*!< Peripheral name */
#define BOARD_I2S1_TX_BCLK_SIGNAL                                           port   /*!< Signal name */
#define BOARD_I2S1_TX_BCLK_CHANNEL                                             1   /*!< Signal channel */
#define BOARD_I2S1_TX_BCLK_PIN_NAME                                         PTB1   /*!< Routed pin name */
#define BOARD_I2S1_TX_BCLK_PIN_FUNCTION_ID                      IOMUXC_PTB1_PTB1   /*!< Pin function id */
#define BOARD_I2S1_TX_BCLK_LABEL                                  "I2S1_TX_BCLK"   /*!< Label */
#define BOARD_I2S1_TX_BCLK_NAME                                   "I2S1_TX_BCLK"   /*!< Identifier */

/* PTB2 (number AE3), I2S1_TX_FS */
/* Routed pin properties */
#define BOARD_I2S1_TX_FS_PERIPHERAL                                          PTB   /*!< Peripheral name */
#define BOARD_I2S1_TX_FS_SIGNAL                                             port   /*!< Signal name */
#define BOARD_I2S1_TX_FS_CHANNEL                                               2   /*!< Signal channel */
#define BOARD_I2S1_TX_FS_PIN_NAME                                           PTB2   /*!< Routed pin name */
#define BOARD_I2S1_TX_FS_PIN_FUNCTION_ID                        IOMUXC_PTB2_PTB2   /*!< Pin function id */
#define BOARD_I2S1_TX_FS_LABEL                                      "I2S1_TX_FS"   /*!< Label */
#define BOARD_I2S1_TX_FS_NAME                                       "I2S1_TX_FS"   /*!< Identifier */

/* PTB3 (number AE4), I2S1_TXD0 */
/* Routed pin properties */
#define BOARD_I2S1_TXD0_PERIPHERAL                                           PTB   /*!< Peripheral name */
#define BOARD_I2S1_TXD0_SIGNAL                                              port   /*!< Signal name */
#define BOARD_I2S1_TXD0_CHANNEL                                                3   /*!< Signal channel */
#define BOARD_I2S1_TXD0_PIN_NAME                                            PTB3   /*!< Routed pin name */
#define BOARD_I2S1_TXD0_PIN_FUNCTION_ID                         IOMUXC_PTB3_PTB3   /*!< Pin function id */
#define BOARD_I2S1_TXD0_LABEL                                        "I2S1_TXD0"   /*!< Label */
#define BOARD_I2S1_TXD0_NAME                                         "I2S1_TXD0"   /*!< Identifier */

/* PTB10 (number AC7), I2S1_RXD0 */
/* Routed pin properties */
#define BOARD_I2S1_RXD0_PERIPHERAL                                           PTB   /*!< Peripheral name */
#define BOARD_I2S1_RXD0_SIGNAL                                              port   /*!< Signal name */
#define BOARD_I2S1_RXD0_CHANNEL                                               10   /*!< Signal channel */
#define BOARD_I2S1_RXD0_PIN_NAME                                           PTB10   /*!< Routed pin name */
#define BOARD_I2S1_RXD0_PIN_FUNCTION_ID                       IOMUXC_PTB10_PTB10   /*!< Pin function id */
#define BOARD_I2S1_RXD0_LABEL                                        "I2S1_RXD0"   /*!< Label */
#define BOARD_I2S1_RXD0_NAME                                         "I2S1_RXD0"   /*!< Identifier */

/* PTB4 (number AG4), PTB4 */
/* Routed pin properties */
#define BOARD_PTB4_PERIPHERAL                                                PTB   /*!< Peripheral name */
#define BOARD_PTB4_SIGNAL                                                   port   /*!< Signal name */
#define BOARD_PTB4_CHANNEL                                                     4   /*!< Signal channel */
#define BOARD_PTB4_PIN_NAME                                                 PTB4   /*!< Routed pin name */
#define BOARD_PTB4_PIN_FUNCTION_ID                              IOMUXC_PTB4_PTB4   /*!< Pin function id */
#define BOARD_PTB4_LABEL                                                  "PTB4"   /*!< Label */
#define BOARD_PTB4_NAME                                                   "PTB4"   /*!< Identifier */

/* PTB5 (number AF4), PTB5 */
/* Routed pin properties */
#define BOARD_PTB5_PERIPHERAL                                                PTB   /*!< Peripheral name */
#define BOARD_PTB5_SIGNAL                                                   port   /*!< Signal name */
#define BOARD_PTB5_CHANNEL                                                     5   /*!< Signal channel */
#define BOARD_PTB5_PIN_NAME                                                 PTB5   /*!< Routed pin name */
#define BOARD_PTB5_PIN_FUNCTION_ID                              IOMUXC_PTB5_PTB5   /*!< Pin function id */
#define BOARD_PTB5_LABEL                                                  "PTB5"   /*!< Label */
#define BOARD_PTB5_NAME                                                   "PTB5"   /*!< Identifier */

/* PTB6 (number AF5), DDR_SW_EN# */
/* Routed pin properties */
#define BOARD_DDR_SW_EN_PERIPHERAL                                           PTB   /*!< Peripheral name */
#define BOARD_DDR_SW_EN_SIGNAL                                              port   /*!< Signal name */
#define BOARD_DDR_SW_EN_CHANNEL                                                6   /*!< Signal channel */
#define BOARD_DDR_SW_EN_PIN_NAME                                            PTB6   /*!< Routed pin name */
#define BOARD_DDR_SW_EN_PIN_FUNCTION_ID                         IOMUXC_PTB6_PTB6   /*!< Pin function id */
#define BOARD_DDR_SW_EN_LABEL                                       "DDR_SW_EN#"   /*!< Label */
#define BOARD_DDR_SW_EN_NAME                                         "DDR_SW_EN"   /*!< Identifier */

